In [2]:
import pandas as pd
import numpy as np

### Задание 1

In [3]:
author_name = pd.DataFrame({'author_id':[1, 2, 3],
                    'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])

In [4]:
author_name

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])

In [6]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [7]:
authors_price = pd.merge(author_name, book, on = 'author_id')

In [8]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [9]:
top5 = authors_price.nlargest(5, 'price')

In [10]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4

In [44]:
authors_stat_max = authors_price.groupby('author_name').agg({'price': 'max'})

In [45]:
authors_stat_max.reset_index('author_name', inplace = True)

In [46]:
authors_stat_min = authors_price.groupby('author_name').agg({'price': 'min'})

In [47]:
authors_stat_min.reset_index('author_name', inplace = True)

In [48]:
authors_stat_mean = authors_price.groupby('author_name').agg({'price': 'mean'})

In [49]:
authors_stat_mean.reset_index('author_name', inplace = True)

In [50]:
authors_stat_max

  author_name  price
0  Островский    370
1    Тургенев    450
2       Чехов    500

In [51]:
authors_stat_min

  author_name  price
0  Островский    290
1    Тургенев    300
2       Чехов    450

In [58]:
authors_stat_mean

  author_name       price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [62]:
authors_stat_mm = pd.merge(authors_stat_max, authors_stat_min, on = 'author_name')

In [63]:
authors_stat = pd.merge(authors_stat_mm, authors_stat_mean, on = 'author_name')

In [64]:
authors_stat

  author_name  price_x  price_y       price
0  Островский      370      290  330.000000
1    Тургенев      450      300  366.666667
2       Чехов      500      450  475.000000

In [71]:
authors_stat = authors_stat.rename(columns= {'price_x':'max_price', 'price_y':'min_price', 'price':'mean_price'})

In [80]:
authors_stat

  author_name  max_price  min_price  mean_price
0  Островский        370        290  330.000000
1    Тургенев        450        300  366.666667
2       Чехов        500        450  475.000000